dom = document.getElementById("calendar");
myChart = echarts.init(dom, 'light');
var app = {};
option = null;

var dateList = [
    ['2017-2-23', '廿七', 144120],
    ['2017-2-24', '廿八', 56276],
    ['2017-2-25', '廿九', 45419],
    ['2017-2-26', '二月', 51750],
    ['2017-2-27', '初二', 25165],
    ['2017-2-28', '初三', 67593],
    ['2017-3-1', '初四', 43888],
    ['2017-3-2', '初五', 30343],
    ['2017-3-3', '初六', 39254],
    ['2017-3-4', '初七', 281853],
    ['2017-3-5', '初八', 133671],
    ['2017-3-6', '初九', 24692],
    ['2017-3-7', '初十', 19134],
    ['2017-3-8', '十一', 23385],
    ['2017-3-9', '十二', 17023],
    ['2017-3-10', '十三', 21531],
    ['2017-3-11', '十四', 17291],
    ['2017-3-12', '十五', 14899],
    ['2017-3-13', '十六', 15253],
    ['2017-3-14', '十七', 14085],
    ['2017-3-15', '十八', 13531],
    ['2017-3-16', '十九', 28641],
    ['2017-3-17', '二十', 33120],
    ['2017-3-18', '廿一', 31018],
    ['2017-3-19', '廿二', 39864],
    ['2017-3-20', '廿三', 46823],
    ['2017-3-21', '廿四', 55213],
    ['2017-3-22', '廿五', 70323],
    ['2017-3-23', '廿六', 63904],
    ['2017-3-24', '廿七', 87530],
    ['2017-3-25', '廿八', 41783],
    ['2017-3-26', '廿九', 46540],
    ['2017-3-27', '三十', 75592],
    ['2017-3-28', '三月', 68907],
    ['2017-3-29', '初二', 70321],
    ['2017-3-30', '初三', 57338],
    ['2017-3-31', '初四', 56827],
    ['2017-4-1', '初五', 55229],
    ['2017-4-2', '初六', 19493],
    ['2017-4-3', '初七', 15817],
    ['2017-4-4', '初八', 16425],
    ['2017-4-5', '初九', 43330],
    ['2017-4-6', '初十', 55752],
    ['2017-4-7', '十一', 60859],
    ['2017-4-8', '十二', 45071],
    ['2017-4-9', '十三', 45761],
    ['2017-4-10', '十四', 67471],
    ['2017-4-11', '十五', 68585],
    ['2017-4-12', '十六', 65248],
    ['2017-4-13', '十七', 73998],
    ['2017-4-14', '十八', 75841],
    ['2017-4-15', '十九', 47258],
    ['2017-4-16', '二十', 51323],
    ['2017-4-17', '廿一', 86716],
    ['2017-4-18', '廿二', 77394],
    ['2017-4-19', '廿三', 73765],
    ['2017-4-20', '廿四', 77072],
    ['2017-4-21', '廿五', 65321],
    ['2017-4-22', '廿六', 34891],
    ['2017-4-23', '廿七', 33236],
    ['2017-4-24', '廿八', 47554],
    ['2017-4-25', '廿九', 47260],
    ['2017-4-26', '四月', 34382]];

var heatmapData = [];
var lunarData = [];
for (var i = 0; i < dateList.length; i++) {
    heatmapData.push([
        dateList[i][0],
        dateList[i][2]
    ]);
    lunarData.push([
        dateList[i][0],
        1,
        dateList[i][1]
    ]);
}
option = {
    title: {
        top: 15,
        left: 'center',
        text: '伪基站威胁日历'
    },
    tooltip: {},
    visualMap: {
        min: 0,
        max: 300000,
        text: ['High', 'Low'],
        type: 'continuous',
        calculable: true,
        realtime: false,
        top: 'bottom',
        textStyle: {
            color: '#000'
        }
    },
    backgroundColor:"#f9f7e8",
    calendar: {
        yearLabel: {
            margin: 40
        },
        dayLabel: {
            firstDay: 1,
            nameMap: ['周日', '周一', '周二', '周三', '周四', '周五', '周六']
        },
        monthLabel: {
            nameMap: 'cn',
            margin: 20
        },
        cellSize: 75,
        top: 65,
        left: 'center',
        range: ['2017-02-23', '2017-04-26']
    },
    series: [{
        type: 'scatter',
        coordinateSystem: 'calendar',
        symbolSize: 1,
        label: {
            normal: {
                show: true,
                formatter: function (params) {
                    var d = echarts.number.parseDate(params.value[0]);
                    return d.getDate() + '\n\n' + params.value[2] + '\n\n';
                },
                textStyle: {
                    color: '#000'
                }
            }
        },
        data: lunarData
    }, {
        name: '短信数量',
        type: 'heatmap',
        coordinateSystem: 'calendar',
        data: heatmapData
    }]
};
if (option && typeof option === "object") {
    myChart.setOption(option, true);
}
